images/services/performance-testing/config/artillery.yml
config:
  target: "http://app:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  plugins:
    metrics-by-endpoint:
      stripQueryString: true

scenarios:
  - name: "API health check"
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "Homepage load test"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200